#+title: Evaluación de la exposición
#+author: Gunnar Wolf

* Caso CrowdStrike y la caída mundial de Windows

- Tema presentado por :: Anikey Andrea Gómez e Ian Yael León
- Calificación global :: Por favor revisen el resto de este archivo para ver de
  dónde vienen todos estos números 😉

|------------------------+------+--------------------+------+---------|
| Evaluación  compañeros | Peso | Evaluación docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                    9.6 |  0.3 |               8.38 |  0.7 |    8.75 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Evaluación grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 2 | 5 |  9.43 |
| Nivel        | 0 | 0 | 0 | 2 | 5 |  9.43 |
| Relevancia   | 0 | 0 | 0 | 0 | 7 | 10.00 |
| Claridad     | 0 | 0 | 0 | 1 | 6 |  9.71 |
| Presencia    | 0 | 0 | 0 | 2 | 5 |  9.43 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.60 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compañeros

(ningún comentario)

* Evaluación por parte del docente

| *Aspecto*              | *Peso* | *Evaluación* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |            5 |       1. |
| Contenido              |    0.2 |           10 |       2. |
| Fuentes bibliográficas |    0.1 |          7.5 |     0.75 |
| Uso del tiempo         |    0.1 |           10 |       1. |
| Dominio del tema       |   0.15 |          7.5 |    1.125 |
| Presencia              |   0.15 |           10 |      1.5 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.38 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- Cuando Anikey va presentando cuál fue la naturaleza del problema, se te hizo
  un poco “bolas” el guión. Supiste re-encontrar la madeja pronto y seguir
  explicando, ¡bien!
- Una corrección de conceptos respecto a lo que explica Ian Yael hacia los 7:20
  (aunque /no es/ lo que causó el fallo): El error de un “apuntador nulo” no es
  que apuntes a un valor nulo en memoria (digamos, que la variable =int *var=
  apunte a la memoria =0x0000DEAD0000BEEF=, y que =0x0000DEAD0000BEEF= contenga
  el valor =0000000000000000=); eso sería completamente legal.
  - El problema ocurre cuando /el apuntador mismo/ es nulo: Cuando =int *var=
    vale =0000000000000000=, e intentas hacer cualquier operación sobre dicha
    variable: Intentar leer o escribir en la dirección =0x0000000000000000=
    lleva sí o sí a una excepción por fallo de página.
- Me quedé pensando en un punto adicional: ¿Recuerdan cuando les presenté
  respecto a los sistemas operativos /monolíticos/ y los sistemas /microkernel/?
  Bueno... Resulta que Windows es un sistema /microkernel/, ¿cierto?
  - Supuestamente, una de las principales ventajas de estos sistemas es que /una
    falla en un controlador no puede tirar al sistema entero/... ¡Pues ahí
    tienen que sí! 😉
  - La necesidad de vincularse desde espacio privilegiado que tiene este
    antivirus hizo que se comprometiera una arquitectura que... precisamente fue
    diseñada para evitar este tipo de problemas. Desde hace más de 40
    años. 😦😦😦
